# Notebook 3

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/nsoria1/icaro-datos-ejemplos/master/stock_data.csv')

In [3]:
df.describe()

       Precio Apertura  Precio Cierre
count          5.00000       5.000000
mean          33.20000      34.600000
std            4.38178       1.949359
min           28.00000      32.000000
25%           32.00000      34.000000
50%           32.00000      34.000000
75%           34.00000      36.000000
max           40.00000      37.000000

In [5]:
df.head()

        Dia  Precio Apertura  Precio Cierre   Resumen
0  1/1/2017             32.0           34.0  Ganancia
1  1/4/2017              NaN           32.0   Perdida
2  1/5/2017             28.0            NaN  Ganancia
3  1/6/2017              NaN           37.0       NaN
4  1/7/2017             32.0            NaN  Ganancia

In [8]:
df

         Dia  Precio Apertura  Precio Cierre   Resumen
0   1/1/2017             32.0           34.0  Ganancia
1   1/4/2017              NaN           32.0   Perdida
2   1/5/2017             28.0            NaN  Ganancia
3   1/6/2017              NaN           37.0       NaN
4   1/7/2017             32.0            NaN  Ganancia
5   1/8/2017              NaN            NaN   Perdida
6   1/9/2017              NaN            NaN       NaN
7  1/10/2017             34.0           36.0   Perdida
8  1/11/2017             40.0           34.0  Ganancia

In [7]:
df.groupby('Resumen').count()

          Dia  Precio Apertura  Precio Cierre
Resumen
Ganancia    4                4              2
Perdida     3                1              2

In [9]:
df.Resumen.value_counts()

Ganancia    4
Perdida     3
Name: Resumen, dtype: int64

In [18]:
print('Un corchete:', type(df['Resumen']))
print('Doble corchete:', type(df[['Resumen']]))
print('Con .loc:', type(df.loc[:, 'Resumen']))

Un corchete: <class 'pandas.core.series.Series'>
Doble corchete: <class 'pandas.core.frame.DataFrame'>
Con .loc: <class 'pandas.core.series.Series'>

In [21]:
type(df.head)

method

In [28]:
special_date = df.set_index('Dia').loc['1/5/2017']
special_date

Precio Apertura          28
Precio Cierre           NaN
Resumen            Ganancia
Name: 1/5/2017, dtype: object

## Condicionales

In [29]:
condition=df['Resumen']=='Ganancia'

In [32]:
df[condition]

         Dia  Precio Apertura  Precio Cierre   Resumen
0   1/1/2017             32.0           34.0  Ganancia
2   1/5/2017             28.0            NaN  Ganancia
4   1/7/2017             32.0            NaN  Ganancia
8  1/11/2017             40.0           34.0  Ganancia

In [33]:
condition2 = df['Precio Apertura'] >= 32
df[condition2]

         Dia  Precio Apertura  Precio Cierre   Resumen
0   1/1/2017             32.0           34.0  Ganancia
4   1/7/2017             32.0            NaN  Ganancia
7  1/10/2017             34.0           36.0   Perdida
8  1/11/2017             40.0           34.0  Ganancia

In [37]:
RESUMENES = ['Ganancia', 'Perdida']
condition3 = df['Resumen'].isin(RESUMENES)
df[condition3]

         Dia  Precio Apertura  Precio Cierre   Resumen
0   1/1/2017             32.0           34.0  Ganancia
1   1/4/2017              NaN           32.0   Perdida
2   1/5/2017             28.0            NaN  Ganancia
4   1/7/2017             32.0            NaN  Ganancia
5   1/8/2017              NaN            NaN   Perdida
7  1/10/2017             34.0           36.0   Perdida
8  1/11/2017             40.0           34.0  Ganancia

In [38]:
def doble_precio_cierre(x):
    if (x>35):
        return 'Muy bueno!'
    else:
        return 'Muy malo'

In [45]:
df['Evaluaction']=df['Precio Cierre'].map(doble_precio_cierre)
df[['Precio Cierre', 'Evaluaction']]

   Precio Cierre Evaluaction
0           34.0    Muy malo
1           32.0    Muy malo
2            NaN    Muy malo
3           37.0  Muy bueno!
4            NaN    Muy malo
5            NaN    Muy malo
6            NaN    Muy malo
7           36.0  Muy bueno!
8           34.0    Muy malo

In [46]:
df.rename(columns={'Evaluaction':'Evaluaction_precio_cierre'}, inplace=True)

In [47]:
df.columns

Index(['Dia', 'Precio Apertura', 'Precio Cierre', 'Resumen',
       'Evaluaction_precio_cierre', 'Evaluaction_precio_cierre'],
      dtype='object')

## Ejercicio 1

In [48]:
import requests

In [49]:
URL = 'https://www1.ncdc.noaa.gov/pub/data/cdo/samples/PRECIP_HLY_sample_csv.csv'

In [50]:
data = requests.get(URL)

In [58]:
data.content

b'STATION,STATION_NAME,ELEVATION,LATITUDE,LONGITUDE,DATE,HPCP,Measurement Flag,Quality Flag\nCOOP:310301,ASHEVILLE NC US,682.1,35.5954,-82.5568,20100101 00:00,99999,], \nCOOP:310301,ASHEVILLE NC US,682.1,35.5954,-82.5568,20100101 01:00,0,g, \nCOOP:310301,ASHEVILLE NC US,682.1,35.5954,-82.5568,20100102 06:00,1, , \n'

In [69]:
PATH = 'src/precio_content.csv'

In [70]:
precio_content = open(PATH, 'wb')

In [71]:
precio_content.write(data.content)
precio_content.close()

In [188]:
# Reading directly
data2 = pd.read_csv(URL, encoding="utf-8")
data2.head()

,STATION,STATION_NAME,ELEVATION,LATITUDE,LONGITUDE,DATE,HPCP,Measurement Flag,Quality Flag
0,COOP:310301,ASHEVILLE NC US,682.1,35.5954,-82.5568,20100101 00:00,99999,],
1,COOP:310301,ASHEVILLE NC US,682.1,35.5954,-82.5568,20100101 01:00,0,g,
2,COOP:310301,ASHEVILLE NC US,682.1,35.5954,-82.5568,20100102 06:00,1,,

## Ejercicio 2

In [77]:
df_precios = pd.read_csv(PATH)

In [79]:
df_precios.head()

,STATION,STATION_NAME,ELEVATION,LATITUDE,LONGITUDE,DATE,HPCP,Measurement Flag,Quality Flag
0,COOP:310301,ASHEVILLE NC US,682.1,35.5954,-82.5568,20100101 00:00,99999,],
1,COOP:310301,ASHEVILLE NC US,682.1,35.5954,-82.5568,20100101 01:00,0,g,
2,COOP:310301,ASHEVILLE NC US,682.1,35.5954,-82.5568,20100102 06:00,1,,

In [81]:
df_precios.shape

(3, 9)

In [82]:
df_precios.describe()

       ELEVATION  LATITUDE  LONGITUDE          HPCP
count        3.0    3.0000     3.0000      3.000000
mean       682.1   35.5954   -82.5568  33333.333333
std          0.0    0.0000     0.0000  57734.160896
min        682.1   35.5954   -82.5568      0.000000
25%        682.1   35.5954   -82.5568      0.500000
50%        682.1   35.5954   -82.5568      1.000000
75%        682.1   35.5954   -82.5568  50000.000000
max        682.1   35.5954   -82.5568  99999.000000

In [84]:
df_precios.dtypes

STATION              object
STATION_NAME         object
ELEVATION           float64
LATITUDE            float64
LONGITUDE           float64
DATE                 object
HPCP                  int64
Measurement Flag     object
Quality Flag         object
dtype: object

## Ejercicio 3

In [151]:
# Add sep=';'
df_cotizacion=pd.read_csv('https://raw.githubusercontent.com/MohaRios/datos_para_ejercicios/master/cotizacion.csv', sep=';')

In [152]:
df_cotizacion.head()

     Nombre  Final Máximo Mínimo  Volumen  Efectivo
0   ACCIONA  95,95  96,75   94,4   84.962   8166,11
1  ACERINOX   8668   8672   8468   885.99   7633,81
2       ACS  37,28  37,66  37,22  655.982  24517,29
3      AENA  167,1  167,5  166,1  133.738  22336,10
4   AMADEUS  69,96  70,64  69,56  640.476  44795,47

In [153]:
df_cotizacion.shape

(35, 6)

In [154]:
df_cotizacion.columns

Index(['Nombre', 'Final', 'Máximo', 'Mínimo', 'Volumen', 'Efectivo'], dtype='object')

In [155]:
df_cotizacion.Nombre.value_counts()

ENDESA          1
BANKIA          1
ENCE            1
CELLNEX         1
ACS             1
MAPFRE          1
BA.SABADELL     1
CIE AUTOMOT.    1
AENA            1
GRIFOLS CL.A    1
TELEFONICA      1
ENAGAS          1
AMADEUS         1
NATURGY         1
INDITEX         1
BANKINTER       1
ARCELORMIT.     1
MELIA HOTELS    1
INDRA A         1
BA.SANTANDER    1
VISCOFAN        1
BBVA            1
ACERINOX        1
IBERDROLA       1
MERLIN          1
IAG             1
MEDIASET        1
FERROVIAL       1
CAIXABANK       1
REPSOL          1
ACCIONA         1
SIEMENS GAME    1
R.E.C.          1
INM.COLONIAL    1
TEC.REUNIDAS    1
Name: Nombre, dtype: int64

In [156]:
cond = df_cotizacion.Volumen == df_cotizacion.Volumen.max()
df_cotizacion[cond]

          Nombre  Final Máximo Mínimo Volumen Efectivo
13  CIE AUTOMOT.  23,44  23,74   23,4  99.506  2343,09

In [157]:
df_cotizacion.query('Volumen == Volumen.max()')

          Nombre  Final Máximo Mínimo Volumen Efectivo
13  CIE AUTOMOT.  23,44  23,74   23,4  99.506  2343,09

In [158]:
df_cotizacion.iloc[df_cotizacion['Volumen'].idxmax()]

TypeError: reduction operation 'argmax' not allowed for this dtype

In [174]:
df_cotizacion['Volumen_sin_punto']=df_cotizacion.Volumen.apply(lambda x: ''.join(x.split('.')))

In [161]:
df_cotizacion['Volumen_sin_punto'].head()

0     84962
1     88599
2    655982
3    133738
4    640476
Name: Volumen_sin_punto, dtype: object

In [162]:
df_cotizacion['Volumen_sin_punto'] = df_cotizacion['Volumen_sin_punto'].astype(int)
df_cotizacion.dtypes

Nombre               object
Final                object
Máximo               object
Mínimo               object
Volumen              object
Efectivo             object
Volumen_sin_punto     int32
dtype: object

In [163]:
df_cotizacion.iloc[df_cotizacion['Volumen_sin_punto'].idxmax()]

Nombre               BA.SANTANDER
Final                        4,02
Máximo                     4,0675
Mínimo                       4,01
Volumen                36.129.692
Efectivo                145765,44
Volumen_sin_punto        36129692
Name: 7, dtype: object

In [164]:
df_cotizacion.query('Volumen_sin_punto == Volumen_sin_punto.max()')

         Nombre Final  Máximo Mínimo     Volumen   Efectivo  Volumen_sin_punto
7  BA.SANTANDER  4,02  4,0675   4,01  36.129.692  145765,44           36129692

In [165]:
# Datos con mayor variación de precios
def get_variation_prices(row):
    return abs(float(row.Máximo) - float(row.Mínimo))

In [175]:
df_cotizacion['Máximo'] = df_cotizacion['Máximo'].apply(lambda x: x.replace(',', ''))
df_cotizacion['Mínimo'] = df_cotizacion['Mínimo'].apply(lambda x: x.replace(',', ''))

In [177]:
df_cotizacion['Variation_price'] = df_cotizacion.apply(get_variation_prices, axis=1)
df_cotizacion[['Máximo', 'Mínimo', 'Variation_price']].head()

  Máximo Mínimo  Variation_price
0   9675    944           8731.0
1   8672   8468            204.0
2   3766   3722             44.0
3   1675   1661             14.0
4   7064   6956            108.0

In [178]:
df_cotizacion.describe()

       Variation_price
count        35.000000
mean       3617.857143
std        7571.059535
min          14.000000
25%          44.000000
50%         150.000000
75%        3587.000000
max       40274.000000

In [184]:
# Exportando
PATH2 = 'src/variation_price_cotizacion.csv'
df_cotizacion[['Nombre', 'Variation_price']].to_csv(PATH2, index = False)

In [185]:
pd.read_csv(PATH2).head()

     Nombre  Variation_price
0   ACCIONA           8731.0
1  ACERINOX            204.0
2       ACS             44.0
3      AENA             14.0
4   AMADEUS            108.0